// 자료구조 3주차 - 1 (1,2,3차원 배열)

/* 선형 순차리스트 = 선형 리스트
* 
 * 순차리스트의 개념
 *  - 순차리스트는 배열을 기반으로 구현된 리스트
 *  - 배열의 특성을 그대로 가지므로 데이터의 빈번한 삽입/삭제에 취약
 *  - 데이터의 삽입/삭제가 잦은 경우에는 다른 자료구조를 사용하는 것이 좋음
 * 
 * C에선 3차원 배열을 [면][행][열]식으로 나타내는데, 실행결과 면 -> 행 -> 열 순서로 작동함
*/

#include <stdio.h>

int main(void) {
	int i, n = 0, * ptr;
	int sale[2][2][4] = { {{63, 84, 140, 130}, // 3차원 배열의 초기화
						{157, 209, 251, 312}},
						{{59, 80, 130, 135},
						{149, 187, 239, 310}} };

	ptr = &sale[0][0][0];
	for (i = 0; i < 16; i++) {
		printf("\n address : %u sale[%2d] = %3d", ptr, i, *ptr); // 시작 주소 + (인덱스 x 4 byte)
		ptr++;
	}

	getchar();
	return 0;
}