#include <stdio.h>

int main() 
{
	float fnum = 100.625;

	return 0;
}

// F5 : 디버깅 시작 / 실행
// F7 : 전체 파일 컴파일
// Ctrl + F7 : 개별 파일 컴파일 
// F9 : 중단점 설정/해제 - Breakpoint Toggle (빨간색 점 추가)
// F10 : 한 줄씩 실행 - Step Over

/* <기본 설정법>
1. f5 눌러서 컴파일 -> 변수값 우클릭 -> 조사식 추가
2. 디버그 -> 창 -> 메모리 창(1) 띄우기
3. 우클릭해서 4바이트 정수 띄우기 -> 주소에 "&val" 입력
*/

// 8bit = 1byte = 16진수 2자리 (ex. 0b, 12, cf) 
// 주소는 4byte로 저장 (ex. ccccccccc 00a51046 )
// 인코더 -> 컴파일러 -> 디코더
// * (de-reference 연산자 : 포인터 선언 및 역참조)
// & (앰퍼샌드 : 주소 연산 및 참조 선언)

// 정수의 경우 음수는 2의 보수로 표현

// <실수>

// IEEE 754 ( 실수 표현 방법 ) (±1.m * 2^(e-127))
// Sign 1bit + Exponent 8bit + Mantissa 23bit => 32bit 표현
// Sign : +는 0, -는 1
// Exponent : 1.11001100 x 2^n 형태로 바꿈 -> n에 127을 더해서 구함 -> 10진수를 2비트 변환
// Mantissa : .(소숫점)뒤의 숫자를 그대로 쭉 적고 뒤엔 0을 쭉 붙임 (왼쪽에 붙게끔)

// Step 1. 소수점 양쪽으로 2진수 변환 
// Step 2. [1.000... x 2^x 형식]으로 변환 -> e 구하기 (2의 계수를 x라 하면, e-127=x 임을 이용해 e 구하기)
// Step 3. 총 32비트를 0,1로 쭉 적기 (1, 8, 23 분리)
// Step 4. 2진수 -> 16진수 총 8자리로 변환

// <포인터>

// 포인터(*)는 무조건 4바이트 !! (중요)
// 포인터 연산시 데이터 타입의 영향을 받음 (char : 1byte, short : 2byte, int : 4byte)